{
  "backend/main.mo": "Main Motoko actor defining data types (Article, XPost, Spotlight, Wisdom, Resource, MissionContent, HomePageLinks) and CRUD operations for each, using in-memory Maps and blob storage via a mixin.",
  "feature_evidence.json": "Feature evidence report documenting the admin authentication gate feature (Internet Identity-based), listing the affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files, describing each component's purpose and recent changes such as isAdmin prop gating and white text color fixes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'Connect the Dots.ICP', mounting the app at the #root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component with tab-based navigation and an Internet Identity login/logout button in the header; derives isAdmin from the identity state and passes it as a prop to all content section components.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog component for adding new ICP progress articles with title, URL, and thumbnail upload fields; includes detailed console logging, upload progress tracking, and toast notifications.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "A dialog component for adding cybercrime articles with title, URL, and thumbnail image upload fields, including upload progress tracking.",
  "frontend/src/components/AddHomePageLinkDialog.tsx": "A dialog component for adding homepage links with title, URL, and thumbnail image upload fields, including upload progress display.",
  "frontend/src/components/AdditionalResources.tsx": "A placeholder component that displays an 'Additional Resources' section with a coming-soon message and a BookOpen icon.",
  "frontend/src/components/AddResourceDialog.tsx": "A dialog component for adding trusted ICP ecosystem resources with name, description, and URL fields.",
  "frontend/src/components/AddSpotlightDialog.tsx": "A dialog component for adding ecosystem spotlight entries with title, content, optional link, and optional image upload with progress tracking.",
  "frontend/src/components/AddWisdomDialog.tsx": "A dialog component for adding investing wisdom quotes with quote/story text and author fields.",
  "frontend/src/components/AddXPostDialog.tsx": "A dialog component for uploading X (Twitter) post screenshots with an optional description field and upload progress indicator.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles fetched from the backend, with admin controls to add, edit, and delete articles via dialogs and a confirmation alert.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Renders a list of ICP ecosystem spotlight entries with admin controls to add, edit, and delete spotlights, including date formatting and loading skeletons.",
  "frontend/src/components/EditArticleDialog.tsx": "A dialog form for editing an existing article's title, URL, and optional thumbnail, using the updateArticle mutation with upload progress tracking.",
  "frontend/src/components/EditCybercrimeArticleDialog.tsx": "A dialog form for editing a cybercrime article's title, URL, and optional thumbnail, using the updateCybercrimeArticle mutation with upload progress tracking.",
  "frontend/src/components/EditHomePageLinkDialog.tsx": "A dialog form for editing a homepage link's title, URL, and optional thumbnail image, using the updateHomePageLink mutation with upload progress support.",
  "frontend/src/components/EditMissionDialog.tsx": "A dialog component for editing mission content (title, description, and images) with file upload progress tracking, using React state and the useUpdateMissionContent mutation hook.",
  "frontend/src/components/EditResourceDialog.tsx": "A dialog component for editing an existing trusted resource's name, description, and URL, using the useUpdateResource mutation hook.",
  "frontend/src/components/EditSpotlightDialog.tsx": "A dialog component for editing an ecosystem spotlight's title, content, optional link, and optional image with upload progress, using the useUpdateSpotlight mutation hook.",
  "frontend/src/components/EditWisdomDialog.tsx": "A dialog component for editing an investing wisdom entry's quote and author fields, using the useUpdateWisdom mutation hook.",
  "frontend/src/components/EditXPostDialog.tsx": "A dialog component for editing an X (Twitter) post's description and optional screenshot image with upload progress, using the useUpdateXPost mutation hook.",
  "frontend/src/components/HomePageLinks.tsx": "A component that displays a grid of quick links with thumbnail images, supporting admin add/edit/delete operations via dialogs and the useGetHomePageLinks/useDeleteHomePageLink hooks.",
  "frontend/src/components/InvestingWisdom.tsx": "Displays a grid of investing wisdom quotes with admin controls to add, edit, and delete entries, using query hooks and confirmation dialogs.",
  "frontend/src/components/LatestProgress.tsx": "Renders a grid of ICP progress articles with thumbnail images and admin controls for adding, editing, and deleting articles.",
  "frontend/src/components/MissionPage.tsx": "Shows the mission page content (title, description, images) fetched via query hook, with an admin edit dialog and skeleton loading state.",
  "frontend/src/components/NavigationMenu.tsx": "A dropdown navigation menu listing all app sections as icon+label items, highlighting the active tab and notifying the parent on tab change.",
  "frontend/src/components/TrustedResources.tsx": "Displays a grid of trusted ICP ecosystem resources with admin controls to add, edit, and delete entries via dialogs and confirmation alerts.",
  "frontend/src/components/XPosts.tsx": "Renders a gallery of X (Twitter) post screenshot images with admin controls to add, edit, and delete posts using query hooks and confirmation dialogs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for CRUD operations on backend data types including Articles, XPosts, Spotlights, Wisdom, Resources, MissionContent, and HomePageLinks, with toast notifications on success/error.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties using an oklch-based futuristic ICP color theme.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based custom colors, ICP-themed glow shadows, custom fonts, border radii, and animation keyframes, with typography and container-queries plugins.",
  "project_state.json": "Project state metadata describing the Connect the Dots ICP content management platform, its existing features (admin auth gate via Internet Identity), architectural notes, and versioning info."
}