{
  "backend/main.mo": "Main Motoko actor defining data types (Article, XPost, Spotlight, Wisdom, Resource, etc.) and CRUD operations for a content management backend, using Map storage and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms the old Spotlight type (with optional image) to a new Spotlight type (with required image), converting null images to empty strings during state migration.",
  "feature_evidence.json": "Feature evidence report mapping three spotlight-related features (add/edit dialog image upload and display card banner image) to their implementing frontend files and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing component responsibilities, admin gating, and recent changes to hooks and dialogs.",
  "frontend/index.css": "Global Tailwind CSS base styles defining OKLCH CSS custom properties for light and dark themes, including background, foreground, card, sidebar, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the React app titled 'Connect the Dots.ICP', mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component providing tab-based navigation across all content sections, Internet Identity login/logout with admin detection, and a hero header with gradient styling.",
  "frontend/src/components/AddArticleDialog.tsx": "A dialog component for adding a new ICP progress article with title, URL, and thumbnail upload fields, using the useAddArticle mutation and ExternalBlob for file handling with upload progress tracking.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "A dialog component for adding a cybercrime-related article with title, URL, and thumbnail fields, using the useAddCybercrimeArticle mutation and ExternalBlob for image upload with progress display.",
  "frontend/src/components/AddHomePageLinkDialog.tsx": "A dialog component for adding a new home page link with title, URL, and thumbnail image upload, using the useAddHomePageLink mutation and showing upload progress via a Progress bar.",
  "frontend/src/components/AdditionalResources.tsx": "A placeholder UI component that renders an 'Additional Resources' section with a card indicating the content is coming soon.",
  "frontend/src/components/AddResourceDialog.tsx": "A dialog component for adding a trusted ICP ecosystem resource with name, description, and URL fields, using the useAddResource mutation without any file upload.",
  "frontend/src/components/AddSpotlightDialog.tsx": "A dialog component for adding an ecosystem spotlight entry with a required header image (with preview), title, content, and optional link fields, using the useAddSpotlight mutation and ExternalBlob for image upload.",
  "frontend/src/components/AddWisdomDialog.tsx": "A dialog component for adding an investing wisdom quote with quote text and author fields, using the useAddWisdom mutation with no file upload.",
  "frontend/src/components/AddXPostDialog.tsx": "A dialog component for uploading X (Twitter) post screenshots with an optional description, including image file selection, upload progress tracking, and form submission via the useAddXPost mutation hook.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles fetched from the backend, with admin controls to add, edit, and delete articles via dialogs and a confirmation alert.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Renders a list of ICP ecosystem spotlight entries with banner images, dates, and links, supporting admin add/edit/delete operations through dialogs and confirmation alerts.",
  "frontend/src/components/EditArticleDialog.tsx": "A dialog form for editing an existing article's title, URL, and optional thumbnail image, using the useUpdateArticle mutation and showing upload progress when a new image is selected.",
  "frontend/src/components/EditCybercrimeArticleDialog.tsx": "A dialog form for editing a cybercrime article's title, URL, and optional thumbnail, using the useUpdateCybercrimeArticle mutation with upload progress support, nearly identical in structure to EditArticleDialog.",
  "frontend/src/components/EditHomePageLinkDialog.tsx": "A dialog component for editing an existing homepage link, allowing users to update the title, URL, and optional thumbnail image with upload progress tracking.",
  "frontend/src/components/EditMissionDialog.tsx": "A dialog component for editing mission content (title, description, and multiple images), with multi-file upload progress tracking and form validation.",
  "frontend/src/components/EditResourceDialog.tsx": "A dialog component for editing a trusted resource's name, description, and URL, using the useUpdateResource mutation hook with toast notifications.",
  "frontend/src/components/EditSpotlightDialog.tsx": "A dialog component for editing an ecosystem spotlight entry, supporting updates to title, content, optional link, and header image with preview and upload progress.",
  "frontend/src/components/EditWisdomDialog.tsx": "A dialog component for editing an investing wisdom entry's quote and author fields, using the useUpdateWisdom mutation hook with toast notifications.",
  "frontend/src/components/EditXPostDialog.tsx": "A dialog component for editing an X (Twitter) post's description and optional screenshot image, with upload progress display and toast notifications.",
  "frontend/src/components/HomePageLinks.tsx": "Displays a grid of quick links with thumbnails, supporting admin add/edit/delete operations via dialogs and confirmation alerts.",
  "frontend/src/components/InvestingWisdom.tsx": "Renders a grid of investing quotes/wisdom cards with admin controls for adding, editing, and deleting entries.",
  "frontend/src/components/LatestProgress.tsx": "Shows a grid of articles with thumbnail images under a 'Probably Nothing…' heading, with admin add/edit/delete functionality.",
  "frontend/src/components/MissionPage.tsx": "Displays the site's mission content (title, description, images) fetched from the backend, with an admin edit dialog.",
  "frontend/src/components/NavigationMenu.tsx": "A dropdown navigation menu listing all main app sections, highlighting the active tab and triggering tab changes on selection.",
  "frontend/src/components/TrustedResources.tsx": "Renders a grid of trusted ICP ecosystem resources with admin controls for adding, editing, and deleting entries.",
  "frontend/src/components/XPosts.tsx": "React component that displays a gallery of X (Twitter) post screenshots, with admin controls to add, edit, and delete posts using dialogs and confirmation alerts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend CRUD operations (articles, X posts, spotlights, etc.), wrapping actor calls with mutations and queries that show toast notifications on success or error.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties using oklch color values for a futuristic ICP-themed design system.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based design tokens, custom fonts, glow box shadows, gradient utilities, and animation keyframes for the ICP theme.",
  "project_state.json": "Project state tracking file recording existing implemented features and pending feature requests, primarily around adding and displaying header photos for ecosystem spotlight entries."
}