{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add header photo to Ecosystem Spotlight entries",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update AddSpotlightDialog to require a header photo upload field at the top of the form",
      "acceptanceCriteria": [
        "The Add Spotlight dialog has a photo upload field at the top of the form.",
        "Submitting a new spotlight without a photo shows a validation error.",
        "Upload progress is shown while the photo is being uploaded.",
        "The photo is included when the spotlight entry is created."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddSpotlightDialog.tsx",
          "operation": "modify",
          "description": "Make the image upload field required and move it to the top of the form. Add validation to prevent submission without a photo. The blob-storage component provides ExternalBlob.fromBytes() for handling uploads and withUploadProgress() for tracking upload progress. Verify the component's usage instructions before implementing. Update the form state to track the image as required, show clear validation feedback if missing, and ensure the ExternalBlob is passed to the addSpotlight backend method."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update EditSpotlightDialog to allow admins to replace the header photo with a preview of the current photo",
      "acceptanceCriteria": [
        "The Edit Spotlight dialog shows a preview of the current header photo.",
        "Admins can upload a replacement photo with progress feedback.",
        "If no new photo is uploaded, the existing photo is preserved on save."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditSpotlightDialog.tsx",
          "operation": "modify",
          "description": "Add a photo preview section that displays the current spotlight image using getDirectURL() from the ExternalBlob. Allow admins to upload a replacement photo using ExternalBlob.fromBytes() with upload progress tracking via withUploadProgress(). Verify the blob-storage component's usage instructions before implementing. If no new photo is selected, preserve the existing image field when calling updateSpotlight. Show the current image thumbnail and provide a file input for replacement."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update EcosystemSpotlight display to render header photos as full-width banner images at the top of each spotlight card",
      "acceptanceCriteria": [
        "Every spotlight card displays its header photo as a full-width banner at the top of the card.",
        "The photo is displayed before the title and content.",
        "Cards without a photo show a styled placeholder area (e.g., a gradient or icon).",
        "The photo layout is visually consistent across all spotlight cards."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EcosystemSpotlight.tsx",
          "operation": "modify",
          "description": "Add a full-width banner image section at the top of each spotlight card using the spotlight.image.getDirectURL() method from the blob-storage component. Verify the component's usage instructions before implementing. Position the image before the title and content. For spotlights without an image (graceful degradation), render a styled placeholder div with a gradient or icon. Ensure consistent aspect ratio and styling across all cards. Use Tailwind classes for responsive image sizing and rounded corners to match the card design."
        }
      ]
    }
  ]
}