{
  "backend/main.mo": "Main Motoko actor defining data types (Article, XPost, Spotlight, Wisdom, Resource) and CRUD operations for managing ICP ecosystem content with blob storage integration for images.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend components describing React Query hooks, dialog forms, and display components with explicit white text styling for dark mode visibility.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, card, and accent colors.",
  "frontend/index.html": "HTML entry point for the React application with title 'Connect the Dots.ICP' and root div mounting point.",
  "frontend/src/App.tsx": "Main React component with tab-based navigation rendering different content sections (progress, xposts, spotlight, wisdom, resources, cybercrime) with hero header and footer.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog form component for adding articles with title, URL, and thumbnail upload, featuring comprehensive logging, progress tracking, and mutation handling with toast notifications.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "Dialog form component for adding cybercrime articles with title, URL, and thumbnail upload, including upload progress tracking and error handling.",
  "frontend/src/components/AddResourceDialog.tsx": "Dialog component for adding trusted ICP ecosystem resources with name, description, and URL fields. Handles form submission via useAddResource hook and displays loading/success states.",
  "frontend/src/components/AddSpotlightDialog.tsx": "Dialog component for adding ecosystem spotlight entries with title and content fields. Uses useAddSpotlight hook for submission with toast notifications and loading states.",
  "frontend/src/components/AddWisdomDialog.tsx": "Dialog component for adding investing wisdom quotes with quote and author fields. Submits via useAddWisdom hook with validation and toast feedback.",
  "frontend/src/components/AddXPostDialog.tsx": "Dialog component for uploading X post screenshots with optional description. Handles image file upload with progress tracking using ExternalBlob and useAddXPost hook.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles with thumbnails and external links. Fetches data via useGetAllCybercrimeArticles and includes add article dialog functionality.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Displays a list of ICP ecosystem spotlight entries with titles, content, and timestamps. Fetches spotlights via useGetAllSpotlights hook and includes add spotlight dialog.",
  "frontend/src/components/InvestingWisdom.tsx": "Displays a grid of motivational investing quotes with author attribution, featuring add/empty state handling and loading skeletons.",
  "frontend/src/components/LatestProgress.tsx": "Shows a grid of ICP progress articles with thumbnails, titles, and external links, including add dialog and loading states.",
  "frontend/src/components/NavigationMenu.tsx": "Dropdown menu component with six navigation items (Progress, X Posts, Spotlight, Wisdom, Resources, Cybercrime) using icons and active state highlighting.",
  "frontend/src/components/TrustedResources.tsx": "Displays trusted ICP ecosystem people/resources in a card grid with name, description, and profile links.",
  "frontend/src/components/XPosts.tsx": "Gallery component for displaying X (Twitter) post screenshots with optional descriptions in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on articles, X posts, spotlights, wisdom quotes, resources, and cybercrime articles. Includes extensive console logging for debugging mutations and queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme using OKLCH color space with ICP-themed futuristic styling. Ensures input text visibility with explicit foreground colors.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH colors, glow shadows, custom fonts (Inter, JetBrains Mono), and animation keyframes for accordion and pulse effects.",
  "project_state.json": "Project metadata tracking a known issue where user content is lost when draft apps expire and redeploy. Feature request AR-1 aims to restore all user-added content after expiration."
}