{
  "backend/main.mo": "Main Motoko actor implementing CRUD operations for articles, X posts, spotlights, wisdom entries, resources, cybercrime articles, home page links, and mission content with blob storage integration and migration support.",
  "backend/migration.mo": "Migration module that adds homePageLinks map to the actor state while preserving existing data structures (articles, xPosts, spotlights, wisdomEntries, resources, cybercrimeArticles, missionContent).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including navigation tab rename (Mission to Overview), Additional Resources tab, home page links section with thumbnails, and delete functionality for all content types.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components describing the React application structure with navigation, CRUD dialogs, content display components, styling with OKLCH colors, and React Query hooks for backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the React application with title 'Connect the Dots.ICP' and root div mounting point.",
  "frontend/src/App.tsx": "Main React component with tab-based navigation rendering different content sections (Mission/Overview with HomePageLinks, Progress, XPosts, Spotlight, Wisdom, Resources, Cybercrime, Additional Resources) with hero header and footer.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog component for adding ICP progress articles with title, URL, and thumbnail upload. Includes extensive logging, upload progress tracking, and uses ExternalBlob for file handling.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "Dialog component for adding cybercrime-related articles with title, URL, and thumbnail. Similar to AddArticleDialog but themed for cybercrime content with red-orange gradient styling.",
  "frontend/src/components/AddHomePageLinkDialog.tsx": "Dialog component for adding links with thumbnails to the home page. Features upload progress tracking with Progress component and Upload icon.",
  "frontend/src/components/AdditionalResources.tsx": "Placeholder component displaying a card for additional resources section with a 'coming soon' message.",
  "frontend/src/components/AddResourceDialog.tsx": "Dialog component for adding trusted ICP ecosystem resources with name, description, and URL fields. No file upload functionality.",
  "frontend/src/components/AddSpotlightDialog.tsx": "Dialog component for highlighting ICP ecosystem projects or people with title, content, optional link, and optional image upload using ExternalBlob.",
  "frontend/src/components/AddWisdomDialog.tsx": "Dialog component for adding motivational investing quotes or stories with quote text and author fields. No file upload functionality.",
  "frontend/src/components/AddXPostDialog.tsx": "Dialog component for adding X (Twitter) post screenshots with image upload, optional description, and upload progress tracking.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Component displaying a grid of cybercrime awareness articles with thumbnail images, supporting add, edit, and delete operations with confirmation dialogs.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Component listing ICP ecosystem spotlight entries with timestamps, supporting CRUD operations through dialogs and delete confirmations.",
  "frontend/src/components/EditArticleDialog.tsx": "Dialog for editing existing articles with title, URL, and optional thumbnail replacement, including upload progress tracking.",
  "frontend/src/components/EditCybercrimeArticleDialog.tsx": "Dialog for editing cybercrime articles with title, URL, and optional thumbnail update functionality, nearly identical to EditArticleDialog but themed for cybercrime content.",
  "frontend/src/components/EditHomePageLinkDialog.tsx": "Dialog component for editing homepage links with title, URL, and optional thumbnail image upload. Includes upload progress tracking and uses the useUpdateHomePageLink mutation hook.",
  "frontend/src/components/EditMissionDialog.tsx": "Dialog component for editing mission content with title, description, and multiple image uploads. Tracks upload progress across multiple files and uses the useUpdateMissionContent mutation hook.",
  "frontend/src/components/EditResourceDialog.tsx": "Dialog component for editing trusted resource entries with name, description, and URL fields. Uses the useUpdateResource mutation hook for updates.",
  "frontend/src/components/EditSpotlightDialog.tsx": "Dialog component for editing ecosystem spotlight entries with title, content, optional link, and optional image upload. Includes upload progress tracking and uses the useUpdateSpotlight mutation hook.",
  "frontend/src/components/EditWisdomDialog.tsx": "Dialog component for editing investing wisdom entries with quote/story text and author fields. Uses the useUpdateWisdom mutation hook for updates.",
  "frontend/src/components/EditXPostDialog.tsx": "Dialog component for editing X (Twitter) posts with optional screenshot image upload and description. Includes upload progress tracking and uses the useUpdateXPost mutation hook.",
  "frontend/src/components/HomePageLinks.tsx": "Displays a grid of quick links with thumbnails, supporting add, edit, and delete operations with confirmation dialogs and toast notifications.",
  "frontend/src/components/InvestingWisdom.tsx": "Shows a collection of investing wisdom quotes with author attribution in a card grid layout, with add, edit, and delete functionality.",
  "frontend/src/components/LatestProgress.tsx": "Renders a grid of ICP progress articles with thumbnails, titled 'Probably Nothing…', supporting CRUD operations via dialogs.",
  "frontend/src/components/MissionPage.tsx": "Displays mission content with title, description, and optional images in a single card layout with edit capability.",
  "frontend/src/components/NavigationMenu.tsx": "Provides a dropdown menu with icons for navigating between different sections (mission, progress, X posts, spotlight, wisdom, resources, cybercrime, additional resources).",
  "frontend/src/components/TrustedResources.tsx": "Shows trusted ICP ecosystem people and resources in a card grid with name, description, and links, supporting add, edit, and delete operations.",
  "frontend/src/components/XPosts.tsx": "React component that displays a grid gallery of X (Twitter) posts with CRUD operations, including add/edit/delete dialogs, image display with hover effects, and loading skeletons.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on various content types (Articles, XPosts, Spotlights, Wisdom, Resources, MissionContent, HomePageLinks) with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a futuristic ICP-themed color scheme for both light and dark modes using OKLCH color space, plus input styling overrides.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH-based color system, ICP-themed glow shadows, custom fonts (Inter, JetBrains Mono), and animation keyframes for accordions and pulse effects.",
  "project_state.json": "Project state tracking file documenting 11 completed features including navigation tab renaming, content management with delete functionality, and home page link sections with thumbnails. Contains pending feature requests for backend data models and CRUD operations."
}