{
  "backend/main.mo": "Main Motoko actor defining data types (Article, XPost, Spotlight, Wisdom, Resource, MissionContent, HomePageLink) and CRUD operations for managing content across all sections with blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to frontend content fetching, error handling, and CRUD operations across all tabs with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and hooks, detailing their functionality including loading states, error handling, CRUD operations, and styling updates for text visibility.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark themes, including ICP-themed colors for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Connect the Dots.ICP application.",
  "frontend/src/App.tsx": "Main React app component with tab-based navigation rendering different content sections (Mission, Progress, XPosts, Spotlight, Wisdom, Resources, Cybercrime, Additional Resources) with hero section, header, and footer.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog component for adding articles with form validation, file upload handling, ExternalBlob conversion with progress tracking, comprehensive logging, and mutation error handling.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "Dialog component for adding cybercrime articles with title, URL, and thumbnail image upload. Includes upload progress tracking and form validation with toast notifications.",
  "frontend/src/components/AddHomePageLinkDialog.tsx": "Dialog component for adding homepage links with title, URL, and thumbnail image. Features upload progress tracking and uses ExternalBlob for file handling.",
  "frontend/src/components/AdditionalResources.tsx": "A placeholder component that displays a \"coming soon\" message for additional resources with a BookOpen icon and gradient header.",
  "frontend/src/components/AddResourceDialog.tsx": "Dialog component for adding trusted ICP ecosystem resources with name, description, and URL fields. Includes form validation and success/error toast notifications.",
  "frontend/src/components/AddSpotlightDialog.tsx": "Dialog component for creating ecosystem spotlights with title, content, optional link, and optional image upload. Handles image upload progress and ExternalBlob conversion.",
  "frontend/src/components/AddWisdomDialog.tsx": "Dialog component for adding investing wisdom quotes with quote text and author fields. Simple form with validation and mutation handling.",
  "frontend/src/components/AddXPostDialog.tsx": "Dialog component for uploading X (Twitter) post screenshots with optional description. Features image upload with progress tracking using ExternalBlob.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles with thumbnail images, supporting CRUD operations (add, edit, delete) and includes loading states, error handling, and confirmation dialogs.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Manages and displays ecosystem spotlight entries in a list format with CRUD operations, showing titles, dates, and action buttons for editing and deleting.",
  "frontend/src/components/EditArticleDialog.tsx": "A dialog form for editing article details (title, URL, thumbnail) with file upload progress tracking and backend actor validation.",
  "frontend/src/components/EditCybercrimeArticleDialog.tsx": "A dialog form for editing cybercrime article details, nearly identical to EditArticleDialog but uses cybercrime-specific mutations and styling.",
  "frontend/src/components/EditHomePageLinkDialog.tsx": "A dialog form for editing homepage link entries with title, URL, and optional thumbnail image upload with progress tracking.",
  "frontend/src/components/EditMissionDialog.tsx": "Dialog component for editing mission content (title, description, and multiple images) with upload progress tracking and form validation.",
  "frontend/src/components/EditResourceDialog.tsx": "Dialog component for editing trusted resource details (name, description, URL) with form validation and mutation handling.",
  "frontend/src/components/EditSpotlightDialog.tsx": "Dialog component for editing ecosystem spotlight entries (title, content, optional link and image) with upload progress tracking.",
  "frontend/src/components/EditWisdomDialog.tsx": "Dialog component for editing investing wisdom entries (quote/story and author) with form validation.",
  "frontend/src/components/EditXPostDialog.tsx": "Dialog component for editing X (Twitter) posts with optional screenshot image upload and description, including upload progress tracking.",
  "frontend/src/components/HomePageLinks.tsx": "Component displaying a grid of quick links with thumbnails, supporting add/edit/delete operations via dialogs and confirmation alerts.",
  "frontend/src/components/InvestingWisdom.tsx": "Displays a grid of motivational investing wisdom cards with add, edit, and delete functionality. Includes loading skeletons, error handling, and confirmation dialogs for deletions.",
  "frontend/src/components/LatestProgress.tsx": "Shows a grid of article cards with thumbnails representing ICP ecosystem progress updates. Supports CRUD operations with dialogs and includes loading/error states.",
  "frontend/src/components/MissionPage.tsx": "Displays mission content with title, description, and optional images in a card layout. Provides edit functionality and handles empty states with a call-to-action.",
  "frontend/src/components/NavigationMenu.tsx": "Dropdown navigation menu with 8 sections (mission, progress, xposts, spotlight, wisdom, resources, cybercrime, additional-resources). Highlights active tab and uses icons for each menu item.",
  "frontend/src/components/TrustedResources.tsx": "Displays trusted ICP ecosystem people/resources in a card grid with name and description. Supports add, edit, and delete operations with confirmation dialogs.",
  "frontend/src/components/XPosts.tsx": "Shows a grid of X (Twitter) post screenshot images with CRUD operations. Includes hover actions for edit/delete and confirmation dialogs for deletions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, creating AuthClient instances with configurable options, and handling identity delegation with expiration checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all CRUD operations across content types (articles, X posts, spotlights, wisdom, resources, cybercrime articles, home page links, and mission content) with toast notifications for success/error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a futuristic ICP-themed color palette for light and dark modes using OKLCH color space, plus input/textarea styling for visibility.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors mapped to CSS variables, custom fonts (Inter, JetBrains Mono), glow shadows, and animation keyframes for accordion and pulse effects.",
  "project_state.json": "Project state tracking document indicating Version 12 content not displaying after redeployment, with feature requests focused on verifying data persistence, CRUD operations, and proper content fetching across all tabs."
}