{
  "backend/main.mo": "Main Motoko actor implementing CRUD operations for articles, X posts, spotlights, wisdom entries, resources, cybercrime articles, home page links, and mission content with blob storage integration and data migration support.",
  "backend/migration.mo": "Migration module that preserves actor state across redeployments by returning the old actor unchanged.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components, hooks, and configuration files describing CRUD operations, UI components with edit/delete functionality, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for ICP-themed UI with pure white foreground text in dark mode.",
  "frontend/index.html": "HTML entry point for the React application with title 'Connect the Dots.ICP' and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component with tab-based navigation rendering different content sections including mission page, articles, X posts, spotlights, wisdom, resources, and cybercrime awareness with hero header and footer.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog component for adding ICP progress articles with title, URL, and thumbnail upload using ExternalBlob with comprehensive logging, progress tracking, and error handling.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "Dialog component for adding cybercrime awareness articles with title, URL, and thumbnail upload using ExternalBlob with upload progress tracking.",
  "frontend/src/components/AddHomePageLinkDialog.tsx": "Dialog component for adding a new home page link with title, URL, and thumbnail image upload. Includes upload progress tracking and uses ExternalBlob for file handling.",
  "frontend/src/components/AdditionalResources.tsx": "Placeholder component displaying a \"coming soon\" message for additional resources section. Shows a card with BookOpen icon and descriptive text.",
  "frontend/src/components/AddResourceDialog.tsx": "Dialog component for adding a trusted resource with name, description, and URL fields. Submits data via useAddResource hook with form validation and toast notifications.",
  "frontend/src/components/AddSpotlightDialog.tsx": "Dialog component for adding ecosystem spotlights with title, content, optional link, and optional image upload. Handles image upload progress and uses ExternalBlob for file management.",
  "frontend/src/components/AddWisdomDialog.tsx": "Dialog component for adding investing wisdom quotes with quote text and author fields. Simple form submission using useAddWisdom hook with validation.",
  "frontend/src/components/AddXPostDialog.tsx": "Dialog component for uploading X (Twitter) post screenshots with optional description. Handles image file upload with progress tracking using ExternalBlob.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles with thumbnail images, supporting add, edit, and delete operations. Includes loading skeletons and confirmation dialogs for deletions.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Shows a list of ecosystem spotlight entries with titles, timestamps, and descriptions, providing add, edit, and delete functionality. Uses cards with hover effects and delete confirmation dialogs.",
  "frontend/src/components/EditArticleDialog.tsx": "Modal dialog for editing article details (title, URL, thumbnail) with optional image upload and progress tracking. Validates inputs and displays toast notifications for success/error states.",
  "frontend/src/components/EditCybercrimeArticleDialog.tsx": "Modal dialog for editing cybercrime article details with the same functionality as EditArticleDialog but themed for cybercrime content. Handles thumbnail uploads with progress tracking and validation.",
  "frontend/src/components/EditHomePageLinkDialog.tsx": "Modal dialog for updating homepage link entries including title, URL, and optional thumbnail replacement. Features upload progress tracking and form validation with toast notifications.",
  "frontend/src/components/EditMissionDialog.tsx": "Dialog component for editing mission content (title, description, and multiple images) with upload progress tracking and form validation.",
  "frontend/src/components/EditResourceDialog.tsx": "Dialog component for editing trusted resource details (name, description, URL) with form validation and toast notifications.",
  "frontend/src/components/EditSpotlightDialog.tsx": "Dialog component for editing ecosystem spotlight entries with title, content, optional link, and optional image upload with progress tracking.",
  "frontend/src/components/EditWisdomDialog.tsx": "Dialog component for editing investing wisdom entries consisting of a quote/story and author name.",
  "frontend/src/components/EditXPostDialog.tsx": "Dialog component for editing X (Twitter) posts with optional screenshot image upload and description, including upload progress tracking.",
  "frontend/src/components/HomePageLinks.tsx": "Component displaying a grid of quick links with thumbnails, supporting add/edit/delete operations via dialogs and confirmation alerts.",
  "frontend/src/components/InvestingWisdom.tsx": "Displays a grid of motivational investing quotes with author attribution, supporting add, edit, and delete operations via dialogs and confirmation alerts.",
  "frontend/src/components/LatestProgress.tsx": "Shows a grid of ICP progress articles with thumbnails, titles, and external links, with CRUD operations through dialogs and delete confirmation.",
  "frontend/src/components/MissionPage.tsx": "Displays mission content with title, description, and optional images in a card layout, with an edit dialog for updating content.",
  "frontend/src/components/NavigationMenu.tsx": "Dropdown menu component with 8 navigation items (mission, progress, xposts, spotlight, wisdom, resources, cybercrime, additional-resources) that controls active tab state.",
  "frontend/src/components/TrustedResources.tsx": "Displays a grid of trusted ICP ecosystem resources with name, description, and external links, supporting add, edit, and delete operations.",
  "frontend/src/components/XPosts.tsx": "Gallery view of X (Twitter) post screenshots with optional descriptions, featuring image display and CRUD operations via dialogs.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth state and identity persistence using the DFINITY AuthClient with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all CRUD operations on backend content types (articles, X posts, spotlights, wisdom, resources, cybercrime articles, home page links, and mission content) using the actor instance.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a futuristic ICP-themed color palette for both light and dark modes using OKLCH color space, plus input/textarea styling overrides.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context wrapping the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors mapped to CSS variables, custom fonts (Inter, JetBrains Mono), glow shadows, gradient utilities, and animation keyframes for the ICP-themed UI.",
  "project_state.json": "Project state file documenting Version 12 redeployment requirements, emphasizing preservation of all backend data and verification that Additional Resources tab, delete buttons, and home page links remain functional."
}