{
  "backend/main.mo": "Main backend actor implementing CRUD operations for articles, X posts, spotlights, wisdom entries, resources, and cybercrime articles using Map storage with timestamp-based sorting and ID generation.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing broken article upload functionality in AddArticleDialog, verifying mutation invocation in useQueries.ts, and ensuring actor initialization checks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components with enhanced logging, white text color fixes for dark mode visibility, and React Query hooks for backend operations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, card, and sidebar colors with pure white foreground in dark mode.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React application titled 'Connect the Dots.ICP'.",
  "frontend/src/App.tsx": "Main application component with tab-based navigation, hero section with ICP branding, content rendering based on active tab state, and footer with caffeine.ai attribution.",
  "frontend/src/components/AddArticleDialog.tsx": "Dialog component for adding articles with comprehensive logging throughout submission flow, file upload handling with progress tracking, ExternalBlob conversion, mutation invocation with mutateAsync, and detailed error handling.",
  "frontend/src/components/AddCybercrimeArticleDialog.tsx": "Dialog component for adding cybercrime articles with title, URL, and thumbnail image upload. Includes upload progress tracking and form validation with toast notifications.",
  "frontend/src/components/AddResourceDialog.tsx": "Dialog component for adding trusted resources in the ICP ecosystem with name, description, and URL fields. Handles form submission with validation and success/error feedback.",
  "frontend/src/components/AddSpotlightDialog.tsx": "Dialog component for adding ecosystem spotlights with title and content fields. Provides form handling with validation and toast notifications for success/error states.",
  "frontend/src/components/AddWisdomDialog.tsx": "Dialog component for adding investing wisdom quotes with quote and author fields. Includes form validation and mutation handling with user feedback.",
  "frontend/src/components/AddXPostDialog.tsx": "Dialog component for uploading X (Twitter) post screenshots with optional description. Features image upload with progress tracking and ExternalBlob handling.",
  "frontend/src/components/CybercrimeAwareness.tsx": "Displays a grid of cybercrime awareness articles with thumbnails and external links. Includes loading skeletons, empty state, and integration with AddCybercrimeArticleDialog.",
  "frontend/src/components/EcosystemSpotlight.tsx": "Displays a list of ecosystem spotlight posts with title, content, and timestamp, featuring add/edit functionality via dialog and loading skeletons.",
  "frontend/src/components/InvestingWisdom.tsx": "Renders a grid of motivational quotes with authors in card format, includes add functionality and loading states.",
  "frontend/src/components/LatestProgress.tsx": "Shows a grid of article cards with thumbnails, titles, and external links, with add dialog and skeleton loading states.",
  "frontend/src/components/NavigationMenu.tsx": "Dropdown menu component with six navigation items (progress, xposts, spotlight, wisdom, resources, cybercrime) that controls active tab state.",
  "frontend/src/components/TrustedResources.tsx": "Displays trusted ICP ecosystem people/resources in a grid with name, description, and profile links, includes add dialog.",
  "frontend/src/components/XPosts.tsx": "Gallery view of X (Twitter) post screenshots with optional descriptions, featuring image display and add functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on all content types (Articles, XPosts, Spotlights, Wisdom, Resources) with extensive logging for debugging backend actor calls.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark ICP-themed UI, ensuring white text in dark mode and proper input/textarea visibility.",
  "frontend/src/main.tsx": "Application entry point wrapping the App with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with OKLCH color system, custom fonts (Inter, JetBrains Mono), glow shadows, and ICP-themed animations for futuristic UI.",
  "project_state.json": "Project metadata defining a six-tab ICP resource hub with known issues including broken menu visibility and article upload functionality regression."
}